# GetCustomFieldId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomFieldData..::..GetCustomFieldId Method
CustomFieldData Class See Also
---
Gets an unique identifier of the custom field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public Guid GetCustomFieldId()
```

Visual Basic
---
```text
Public Function GetCustomFieldId As Guid
```

Visual C++
---
```text
public:
Guid GetCustomFieldId()
```

# ### Return Value
Returns an unique identifier of type of custom field.
# See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace